app/controllers/evenements_controller.rb

  def index
    @evenements = Evenement.all
---
SELECT "evenements".* FROM "evenements"

  def show
    @evenement = Evenement.find(params[:id])
---
SELECT "evenements".* FROM "evenements" WHERE "evenements"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @evenement = Evenement.find(params[:id])
---
SELECT "evenements".* FROM "evenements" WHERE "evenements"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @evenement = Evenement.new(params[:evenement])

    respond_to do |format|
      if @evenement.save
---
INSERT INTO "evenements" ("content", "created_at", "date", "place", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @evenement = Evenement.find(params[:id])
    @evenement.destroy
---
SELECT "evenements".* FROM "evenements" WHERE "evenements"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "evenements" WHERE "evenements"."id" = ?  [["id", 3]]